

       Dcl-Pr DayOfWeek  ZONED(1);
         AnyDate  Date;
       End-Pr;

       Dcl-Pr DayName   Char(9);
         AnyDate  Date;
       End-Pr;
 